app/Controllers/Admin/Gererqcm.php

    public function index()
    {
        session_start();
        if(!array_key_exists('id',$_SESSION))
        {
            return redirect()->to('/acceder');
        }
        $titles=[
            'title' => 'Liste des QCM'
        ];
        $model=new QcmModel();
        $qcm=$model->select('id_qcm,designation,domaine_etude.designation_etu AS detu')
                   ->join('domaine_etude','qcm.id_etude=domaine_etude.id_etude','left')
                   ->orderBy('id_qcm','asc')
                   ->findAll();
---
SELECT `id_qcm`, `designation`, `domaine_etude`.`designation_etu` AS `detu`
FROM `qcm`
LEFT JOIN `domaine_etude` ON `qcm`.`id_etude`=`domaine_etude`.`id_etude`
ORDER BY `id_qcm` ASC

    public function modifierQCM($id_qcm)
    {
        $model4=new QuestionModel();
        $questions=$model4->where('id_qcm',$id_qcm)->findAll();
---
SELECT *
FROM `question`
WHERE `id_qcm` = '1'