app/Controllers/Admin/Gerer.php

SELECT *
FROM `question`
WHERE `id_qcm` = '1'
---
    public function modifierQCM($id_qcm)
    {
        $model4=new QuestionModel();
        $questions=$model4->where('id_qcm',$id_qcm)->findAll();

INSERT INTO `admin` (`pseudoAdmin`, `nom`, `prenom`, `motDePasse`, `admin_created_at`, `admin_updated_at`) VALUES ('bbbghhgzjbjh', 'VGYBUHJ?KNB', 'BHNI?OK JGHFG', 'd2488c995b9e86e3e164fd0812f04e06', '2022-09-14 11:06:41', '2022-09-14 11:06:41')
---
    public function ajouterAdmin()
    {
        $titles=[
            'title'=>'Nouvel administrateur'
        ];
        $model=new AdminModel();
        if (strtolower($this->request->getMethod()) !== 'post') {
            return view('templates/admin/header',$titles)
            .view('admin/ajouterAdmin', ['validation' => Services::validation()])
            .view('templates/admin/footer');
        }
        $rules=[
            'pseudoAdmin'=>'required',
            'nomAdmin'=>'required',
            'prenomAdmin'=>'required',
            'password'=>'required'
        ];
        if (! $this->validate($rules)) {
            return view('templates/admin/header',$titles)
            .view('admin/ajouterAdmin', ['validation' => $this->validator])
            .view('templates/admin/footer');
        }else{
            $dataAdmin=[
            'pseudoAdmin'=>trim($_POST['pseudoAdmin']),
            'nom'=>trim($_POST['nomAdmin']),
            'prenom'=>trim($_POST['prenomAdmin']),
            'motDePasse'=>md5(trim($_POST['password']))
        ];
        $model->save($dataAdmin);