app/Controllers/Admin/Gereradministrateur.php

SELECT *
FROM `admin`
WHERE `idAdmin` > 1
---
    public function index()
    {
        session_start();
        if(!array_key_exists('id',$_SESSION))
        {
            return redirect()->to('/espaceadmin');
        }
        $titles=[
            'title'=>'Liste des administrateurs'
        ];
        $model=new AdminModel();
        $admin=$model->where('idAdmin>',1)->findAll();

SELECT *
FROM `admin`
WHERE `idAdmin` = '3'
---
    public function modifierAdmin($idAdmin)
    {
        $model=new AdminModel();
        $admins=$model->where('idAdmin',$idAdmin)->findAll();