app/Controllers/Qcm.php

    public function index($idqcm)
    {
        $titles=
        [
            'title'=>'Accéder QCM'
        ];
        $model=new QuestionModel();
        $question=$model->where('id_qcm',$idqcm)->findAll();
---
SELECT *
FROM `question`
WHERE `id_qcm` = '1'